using Microsoft.EntityFrameworkCore.Migrations;

namespace AlirezaRezaee.Web.Data.Migrations
{
    public partial class InsertDefaultOptions4 : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql(@"INSERT INTO[Options]([OptionName], [OptionValue]) VALUES(N'AboutAuthor', N'محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / محل متن کامل درباره ما / ')");
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql("DELETE FROM [Option] WHERE [OptionName] = N'AboutAuthor'");
        }
    }
}
